
stages = {1 : {'СТАДИЯ' : '1',
               'ФОНЫ' : {1 : ('files/images/S1R1/room_outside_atlas.png', (0, 0, 1023, 767), (0, 800, 1023, 1567), (0, 1600, 1023, 2367)),
                         2 : ('files/images/S1R2/room_kitchen.png',),
                         3 : ('Files/Images/S1R3/room_large.png',),
                         11: ('Files/Images/S1R1/room_outside_atlas_leaves.png', (0, 0, 1023, 767), (0, 784, 1023, 1551), (0, 1568, 1023, 2335))},

               'ТВЕРДЫЕ ОБЪЕКТЫ' : {1 : ((0, 0, 1024, 244,  None, 0, 0, 0), # верхняя стена
                                         (0, 0, 532, 288,  None, 0, 0, 0), # левый пристенок
                                         (696, 0, 324, 288,  None, 0, 0, 0), # правый пристенок
                                         (1004, 0, 20, 778, None, 0, 0, 0), # правая стена
                                         (0, 668, 1024, 130, None, 0, 0, 0), # нижняя стена
                                         (0, 0, 20, 768, None, 0, 0, 0), # левая стена
                                         (312, 256, 96, 72, 'Files/Images/S1R1/room_outside_table_1.png', 312, 256, 1), # серый стол
                                         (108, 528, 104, 104, 'Files/Images/S1R1/room_outside_table_2.png', 96, 500, 2), # синий стол первый
                                         (336, 528, 104, 104, 'Files/Images/S1R1/room_outside_table_2.png', 324, 500, 3), # синий стол второй
                                         (0, 300, 20, 140, 'Files/Images/S1R1/room_outside_handrail.png', 107, 373, 0), # поручень
                                         (108, 408, 708, 20, None, 0, 0, 0), # ступени
                                         (480, 266, 52, 20, 'Files/Images/S1R1/room_outside_bush_1.png', 468, 212, 0), # елка
                                         (116, 636, 356, 40, 'Files/Images/S1R1/room_outside_bush_2.png', 110, 594, 0) ), # кусты внизу

                                    2 : ((0, 0, 588, 112, None, 0, 0, 0), # верхняя стена
                                         (0, 0, 800, 60, None, 0, 0, 0), # ограничитель
                                         (736, 0, 298, 778, None, 0, 0, 0), # правая стена
                                         (700, 0, 298, 112, None, 0, 0, 0), # ограничитель
                                         (0, 688, 1024, 130, None, 0, 0, 0), # нижняя стена
                                         (0, 656, 384, 130, None, 0, 0, 0), # ограничитель левый
                                         (600, 656, 384, 130, None, 0, 0, 0), # ограничитель правый
                                         (0, 0, 312, 768, None, 0, 0, 0), # левая стена

                                         (312, 112, 252, 40, 'Files/Images/S1R2/room_kitchen_woodrobe_1.png', 234, 27, 0), # кухонный шкаф
                                         (264, 420, 0, 1, 'Files/Images/S1R2/room_kitchen_table_5.png', 234, 217, 0), # кухонная полка
                                         (312, 260, 40, 160, 'Files/Images/S1R2/room_kitchen_table_1.png', 288, 236, 0), # кухонный стол слева
                                         (312, 420, 40, 60, 'Files/Images/S1R2/room_kitchen_barista_chair.png', 300, 423, 0), # стул бариста
                                         (312, 476, 48, 108, 'Files/Images/S1R2/room_kitchen_cooler.png', 272, 476, 0), # холодильник
                                         (360, 492, 96, 60, 'Files/Images/S1R2/room_kitchen_table_2.png', 360, 473, 0), # большой стол левый
                                         (456, 272, 96, 278, 'Files/Images/S1R2/room_kitchen_table_3.png', 456, 253, 0), # большой стол правый
                                         (675, 537, 60, 120, 'Files/Images/S1R2/room_kitchen_woodrobe_2.png', 675, 537, 0), # шкаф с мерчем
                                         (648, 208, 110, 88, 'Files/Images/S1R2/room_kitchen_table_4.png', 649, 184, 1), # верхний красный стол
                                         (648, 404, 110, 80, 'Files/Images/S1R2/room_kitchen_table_4.png', 649, 380, 2)), # нижний красный стол

                                    3 : ((0, 0, 1024, 112, None, 0, 0, 0), # верхняя стена
                                         (914, 0, 130, 778, None, 0, 0, 0), # правая стена
                                         (0, 656, 1024, 130, None, 0, 0, 0), # нижняя стена
                                         (0, 0, 112, 548, None, 0, 0, 0), # левая стена

                                         (112, 114, 80, 84, 'Files/Images/S1R3/room_large_flower_1.png', 86, 92, 0), # цветок в верхнем левом углу
                                         (112, 174, 80, 84, None, 98, 174, 0), # серый стул в верхнем левом углу
                                         (228, 174, 80, 84, 'Files/Images/S1R3/room_large_table_1.png', 218, 164, 1), # круглый стол слева вверху
                                         (312, 114, 80, 84, None, 300, 104, 0), # крутящийся серый стул в верхнем левом углу
                                         (112, 270, 48, 68, 'Files/Images/S1R3/room_large_table_2.png', 98, 270, 0), # розовая тумбочка
                                         (460, 116, 84, 166, 'Files/Images/S1R3/room_large_woodrobe_1.png', 458, 96, 0), # красная книжная полка
                                         (626, 96, 110, 110, 'Files/Images/S1R3/room_large_table_with_chairs_1.png', 623, 94, 2), # красный стол вверху
                                         (824, 112, 108, 88, 'Files/Images/S1R3/room_large_flower_2.png', 806, 104, 0), # цветок вверху справа

                                         (112, 408, 212, 90, 'Files/Images/S1R3/room_large_table_with_chairs_2.png', 98, 385, 3), # двойной стол слева
                                         (422, 382, 176, 140, 'Files/Images/S1R3/room_large_table_with_chairs_3.png', 420, 360, 4), # круглый стол в центре
                                         (702, 308, 110, 94, 'Files/Images/S1R3/room_large_table_with_chairs_1.png', 699, 290, 5), # красный стол справа

                                         (782, 512, 80, 76, 'Files/Images/S1R3/room_large_table_4.png', 770, 498, 6), # круглый стол справа внизу
                                         (700, 580, 80, 76, None, 692, 566, 0), # нижний серый стул справа внизу
                                         (852, 464, 60, 44, None, 848, 442, 0), # правый серый стул справа внизу
                                         (848, 588, 60, 60, 'Files/Images/S1R3/room_large_flower_3.png', 844, 580, 0), # цветок справа внизу

                                         (328, 604, 350, 50, 'Files/Images/S1R3/room_large_woodrobe_2.png', 302, 604, 0), # книжная полка
                                         (168, 630, 96, 40, 'Files/Images/S1R3/room_large_table_3.png', 166, 620, 0), # стелла слева внизу
                                         )},
               'ИНТЕРАКТИВНЫЕ ОБЪЕКТЫ (npc)' : {1: ((400, 432, 48, 48),
                                                    (52, 592, 48, 48)),
                                                2: ((400, 180, 48, 48),
                                                    (360, 572, 48, 48)),
                                                3: ((400, 180, 48, 48),
                                                    (52, 592, 48, 48))},
               'СТУЛЬЯ (npc)' : {1: ((260, 312, 278, 286, 'Files/Images/S1R1/room_outside_chair_1.png', 276, 278, 1, 'вправо'),
                                     (416, 312, 394, 286, 'Files/Images/S1R1/room_outside_chair_2.png', 386, 278, 1, 'влево'),
                                     (52, 560, 60, 568, 'Files/Images/S1R1/room_outside_chair_4.png', 48, 554, 2, 'вверх-вправо'),
                                     (212, 560, 217, 568, 'Files/Images/S1R1/room_outside_chair_3.png', 198, 558, 2, 'вверх-влево'),
                                     (280, 560, 288, 568, 'Files/Images/S1R1/room_outside_chair_4.png', 276, 554, 3, 'вверх-вправо'),
                                     (438, 560, 445, 568, 'Files/Images/S1R1/room_outside_chair_3.png', 426, 558, 3, 'вверх-влево')
                                     ),
                                 2: ((664, 132, 684, 166, 'Files/Images/S1R2/room_kitchen_chair_2.png', 678, 150, 1, 'вниз'),
                                     (664, 296, 682, 278, 'Files/Images/S1R2/room_kitchen_chair_1.png', 678, 280, 1, 'вверх'),
                                     (664, 332, 684, 362, 'Files/Images/S1R2/room_kitchen_chair_2.png', 678, 344, 2, 'вниз'),
                                     (664, 496, 682, 472, 'Files/Images/S1R2/room_kitchen_chair_1.png', 678, 474, 2, 'вверх')
                                     ),
                                 3: ((164, 260, 155, 194, 'Files/Images/S1R3/room_large_chair_1.png', 98, 174, 1, 'вправо'), # коричневый стол слева вверху
                                     (320, 200, 315, 140, 'Files/Images/S1R3/room_large_chair_2.png', 300, 104, 1, 'вниз-влево'), #
                                     (572, 140, 589, 128, 'Files/Images/S1R3/room_large_chair_7.png', 575, 122, 2, 'вправо'), # красный стол сверху
                                     (736, 140, 724, 128, 'Files/Images/S1R3/room_large_chair_8.png', 726, 126, 2, 'влево'), #
                                     (160, 348, 133, 364, 'Files/Images/S1R3/room_large_chair_5.png', 127, 350, 3, 'вниз'), # двойной красный стол слева
                                     (252, 348, 246, 364, 'Files/Images/S1R3/room_large_chair_5.png', 240, 350, 3, 'вниз'), #
                                     (140, 500, 132, 478, 'Files/Images/S1R3/room_large_chair_6.png', 127, 488, 3, 'вверх'), #
                                     (252, 500, 245, 478, 'Files/Images/S1R3/room_large_chair_6.png', 240, 488, 3, 'вверх'), #
                                     (400, 332, 420, 370, 'Files/Images/S1R3/room_large_chair_11.png', 408, 355, 4, 'вниз-вправо'), # круглый стол
                                     (560, 332, 548, 375, 'Files/Images/S1R3/room_large_chair_12.png', 533, 355, 4, 'вниз-влево'), #
                                     (400, 524, 408, 488, 'Files/Images/S1R3/room_large_chair_13.png', 400, 472, 4, 'вверх-вправо'), #
                                     (560, 524, 562, 494, 'Files/Images/S1R3/room_large_chair_14.png', 542, 474, 4, 'вверх-влево'), #
                                     (652, 324, 665, 326, 'Files/Images/S1R3/room_large_chair_9.png', 655, 320, 5, 'вправо'), # красный стол справа
                                     (824, 324, 797, 326, 'Files/Images/S1R3/room_large_chair_10.png', 790, 320, 5, 'влево'), #
                                     (724, 528, 727, 577, 'Files/Images/S1R3/room_large_chair_3.png', 692, 566, 6, 'вверх-вправо'), # коричневый стол справа внизу
                                     (800, 444, 850, 462, 'Files/Images/S1R3/room_large_chair_4.png', 848, 442, 6, 'вниз-влево')
                                     )} #
               },
          2 : {'СТАДИЯ' : '2',
               'ФОНЫ' : {1 : 'files/images/room_outside_2.jpg',
                         2 : 'files/images/room_kitchen_2.jpg',
                         3 : 'files/images/room_large_2.jpg'},
               'КООРДИНАТЫ' : {1: (0, 90),
                               2: (170, 0),
                               3: (0, 0)},
               'ТВЕРДЫЕ ОБЪЕКТЫ' : {1 : ((0, 350, 200, 100), ),
                                    2 : ((0, 350, 200, 100),
                                         (400, 250, 150, 130) ),
                                    3 : ((0, 350, 200, 100),
                                         (400, 250, 150, 130),
                                         (0, 0, 250, 200),
                                         (400, 0, 100, 150),
                                         (550, 0, 100, 100))},
               'ИНТЕРАКТИВНЫЕ ОБЪЕКТЫ (npc)' : {1: ((600, 600, 50, 50),
                                                    (100, 100, 50, 50)),
                                                2: ((500, 500, 50, 50),
                                                    (300, 100, 50, 50)),
                                                3: ((400, 180, 50, 50),
                                                    (50, 600, 50, 50))},
               'СТУЛЬЯ (npc)' : {1: ((300, 600, 50, 50),
                                     (200, 650, 50, 50)),
                                 2: ((400, 500, 50, 50),
                                     (150, 250, 50, 50)),
                                 3: ((500, 400, 50, 50),
                                     (620, 620, 50, 50))}
               }
          }


if __name__ == '__main__':
    print (stages)